; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	thermograph0 - mode
	thermograph1 - mode
	thermograph2 - mode
	spectrograph3 - mode
	GroundStation5 - direction
	Star0 - direction
	Star2 - direction
	Star4 - direction
	Star1 - direction
	Star3 - direction
	GroundStation6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument6 spectrograph3)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star1)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star1)
	(supports instrument8 thermograph2)
	(supports instrument8 spectrograph3)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star0)
	(calibration_target instrument9 GroundStation6)
	(supports instrument10 thermograph0)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation5)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 Star4)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 Star3)
	(supports instrument13 spectrograph3)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 Star1)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star0)
	(supports instrument14 thermograph0)
	(calibration_target instrument14 GroundStation6)
	(calibration_target instrument14 Star3)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation6)
)
(:goal (and
	(pointing satellite1 Planet7)
	(pointing satellite3 GroundStation6)
	(pointing satellite5 Phenomenon8)
	(pointing satellite6 Star1)
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 spectrograph3)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 spectrograph3)
	(have_image Planet11 thermograph1)
))

)

; plan
1. (turn_to satellite5 star1 star0)
   deleted: (pointing satellite5 star0)
   added: (pointing satellite5 star1)
   goals met: 1 of 9
2. (switch_on instrument13 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument13)
   goals met: 1 of 9
3. (calibrate satellite5 instrument13 star1)
   added: (calibrated instrument13)
   goals met: 1 of 9
4. (turn_to satellite5 star10 star1)
   deleted: (pointing satellite5 star1)
   added: (pointing satellite5 star10)
   goals met: 1 of 9
5. (take_image satellite5 star10 instrument13 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 2 of 9
6. (turn_to satellite5 planet11 star10)
   deleted: (pointing satellite5 star10)
   added: (pointing satellite5 planet11)
   goals met: 2 of 9
7. (take_image satellite5 planet11 instrument13 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 3 of 9
8. (turn_to satellite5 phenomenon8 planet11)
   deleted: (pointing satellite5 planet11)
   added: (pointing satellite5 phenomenon8)
   goals met: 4 of 9
9. (turn_to satellite3 star1 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star1)
   goals met: 4 of 9
10. (take_image satellite5 phenomenon8 instrument13 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 5 of 9
11. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 5 of 9
12. (calibrate satellite3 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 5 of 9
13. (turn_to satellite3 phenomenon9 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon9)
   goals met: 5 of 9
14. (take_image satellite3 phenomenon9 instrument7 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 6 of 9
15. (turn_to satellite3 planet7 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet7)
   goals met: 6 of 9
16. (take_image satellite3 planet7 instrument7 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 7 of 9
17. (turn_to satellite3 groundstation6 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 groundstation6)
   goals met: 8 of 9
18. (turn_to satellite6 star1 groundstation6)
   deleted: (pointing satellite6 groundstation6)
   added: (pointing satellite6 star1)
   goals met: 9 of 9
